{
  "project": {
    "id": "kafka",
    "title": "Kafka",
    "date": "04/2024",
    "tags": ["Backend", "Message Broker"],
    "details": {
      "content": [
        {
          "title": "Can Kafka lose messages?",
          "summary": "A good practice is to combine both synchronous and asynchronous commits, where one uses asynchronous commits in the processing loop for higher throughput and synchronous commits in exception handling to make sure the the last offset is always committed.",
          "p": [
            "A common belief among many developers is that Kafka, by its very design, guarantees no message loss. However, understanding the nuances of Kafka's architecture and configuration is essential to truly grasp how and when it might lose messages, and more importantly, how to prevent such scenarios.",
            "The diagram below shows how a message can be lost during its lifecycle in Kafka."
          ],
          "img": "https://substackcdn.com/image/fetch/w_550,c_limit,f_auto,q_auto:good,fl_lossy/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F6d1c69b6-3125-4310-838e-4549442ea08a_1280x1664.gif"
        },
        {
          "subtitle": "Producer",
          "p": [
            "When one calls producer.send() to send a message, it doesn't get sent to the broker directly. There are two threads and a queue involved in the message-sending process:",
            {
              "ol": [
                "Application thread",
                "Record accumulator",
                "Sender thread (I/O thread)"
              ]
            },
            "One needs to configure proper 'acks' and 'retries' for the producer to make sure messages are sent to the broker."
          ]
        },
        {
          "subtitle": "Broker",
          "p": [
            "A broker cluster should not lose messages when it is functioning normally. However, one need to understand which extreme situations might lead to message loss:",
            {
              "ol": [
                "The messages are usually flushed to the disk asynchronously for higher I/O throughput, so if the instance is down before the flush happens, the messages are lost.",
                "The replicas in the Kafka cluster need to be properly configured to hold a valid copy of the data. The determinism in data synchronization is important."
              ]
            }
          ]
        },
        {
          "subtitle": "Consumer",
          "p": [
            "Kafka offers different ways to commit messages. Auto-committing might acknowledge the processing of records before they are actually processed. When the consumer is down in the middle of processing, some records may never be processed."
          ]
        }
      ],
      "source": [
        {
          "text": "ByteByteGo Newsletter EP106",
          "href": "https://blog.bytebytego.com/p/ep106-how-does-javascript-work"
        }
      ]
    }
  }
}
